; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 871065 2 3 2 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
)
(:goal (and
	(pointing satellite0 Phenomenon4)
	(have_image Star3 image1)
	(have_image Phenomenon4 image1)
	(have_image Planet5 image1)
	(have_image Star6 image1)
	(have_image Planet7 spectrograph0)
	(have_image Star8 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
3. (turn_to satellite0 star2 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star2)
   goals met: 0 of 7
4. (turn_to satellite1 star8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star8)
   goals met: 0 of 7
5. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 7
6. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 0 of 7
7. (turn_to satellite0 phenomenon4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon4)
   goals met: 1 of 7
8. (turn_to satellite1 groundstation1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 7
9. (take_image satellite0 phenomenon4 instrument0 image1)
   added: (have_image phenomenon4 image1)
   goals met: 2 of 7
10. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 7
11. (turn_to satellite0 star8 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star8)
   goals met: 1 of 7
12. (turn_to satellite1 star6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
13. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 2 of 7
14. (take_image satellite1 star6 instrument1 image1)
   added: (have_image star6 image1)
   goals met: 3 of 7
15. (turn_to satellite0 phenomenon4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon4)
   goals met: 4 of 7
16. (turn_to satellite1 star3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star3)
   goals met: 4 of 7
17. (take_image satellite1 star3 instrument1 image1)
   added: (have_image star3 image1)
   goals met: 5 of 7
18. (turn_to satellite0 planet7 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
19. (turn_to satellite1 planet5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet5)
   goals met: 4 of 7
20. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 5 of 7
21. (turn_to satellite0 phenomenon4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon4)
   goals met: 6 of 7
22. (take_image satellite1 planet5 instrument1 image1)
   added: (have_image planet5 image1)
   goals met: 7 of 7
